src/main/resources/cdm-sample-files/dtcc-9-0/SamplePayment.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:mtc="OTC_Matching_9-0"
    xmlns:rm="OTC_RM_9-0"
    xmlns:fpml="http://www.fpml.org/2010/FpML-4-9" 
    xsi:schemaLocation="OTC_Matching_9-0 ../../schemas/dtcc-9-0/OTC_Matching_9-0.xsd
    http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-9-0/soap-envelope.xsd">
    <env:Header>
        <OTC_RM
            xmlns="OTC_RM_9-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Auto</Status>
                    <TransType>Payment</TransType>
                    <ProductType>CreditDefaultSwapIndex</ProductType>
                    <YourTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00002222"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">CFR_25FC5C21BC124E669CF3C3C24E342FE112</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="DTCCTradeId">20180911.1000033440</fpml:tradeId>
                        </partyTradeIdentifier>
                    </YourTradeId>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00001111"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">CFR_25FC5C21BC124E669CF3C3C24E342FE111</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="DTCCTradeId">20180911.1000033440</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                </TradeMsg>
                <MsgId>MSERV20180911.0016700644</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>DTCC</From>
                    <To>DTCC00002222</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.dtcc.net</RouteAddress>
                        <ReceiveTime>2018-09-10T19:03:10.935-05:00</ReceiveTime>
                        <ReleaseTime>2018-09-10T19:03:22.739-05:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching
            xmlns="OTC_Matching_9-0">
            <Activity>New</Activity>
            <Status>Auto</Status>
            <Payment>
                <PaymentDetails>
                    <PaymentActivity>New</PaymentActivity>
                    <SettlementType>NotCentralSettlement</SettlementType>
                </PaymentDetails>
                <FpML version="4-9"
                    xmlns="http://www.fpml.org/2010/FpML-4-9"
                    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
					xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd" xsi:type="TradeCashflowsAsserted">
                    <header>
                        <messageId messageIdScheme="perFpMLReqmt">MSERV20180911.0016700644</messageId>
                        <sentBy>DTCC</sentBy>
                        <sendTo>DTCC00002222</sendTo>
                        <creationTimestamp>2018-09-10T20:03:43.276-04:00</creationTimestamp>
                    </header>
                    <tradeCashflowsId tradeCashflowsIdScheme="DTCCCashflowId">900004000045126</tradeCashflowsId>
                    <tradeIdentifyingItems>
                        <partyTradeIdentifier>
                            <partyReference href="DTCC00002222" />
                            <tradeId tradeIdScheme="TradeRefNbr">CFR_25FC5C21BC124E669CF3C3C24E342FE112</tradeId>
                            <tradeId tradeIdScheme="DTCCTradeId">20180911.1000033440</tradeId>
                        </partyTradeIdentifier>
                    </tradeIdentifyingItems>
                    <adjustedPaymentDate>2018-09-12</adjustedPaymentDate>
                    <payment>
                        <identifier paymentIdScheme="DTCCNetPaymentId">0111102222U18255</identifier>
                        <payerPartyReference href="DTCC00001111" />
                        <receiverPartyReference href="DTCC00002222" />
                        <paymentAmount>
                            <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                            <amount>1418.33</amount>
                        </paymentAmount>
                        <calculationDetails>
                            <grossCashflow>
                                <cashflowType cashflowTypeScheme="http://www.dtcc.com/coding-scheme/cashflow-type">Coupon</cashflowType>
                            </grossCashflow>
                            <observationElements id="InsufficientData">
                                <underlyerReference href="InsufficientData" />
                                <observationDate>2018-09-11</observationDate>
                            </observationElements>
                            <calculationElements>
                                <notional>
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                    <amount>5000000.00</amount>
                                </notional>
                                <underlyer>
                                    <fixedRate>
                                        <initialValue>0.00111000</initialValue>
                                    </fixedRate>
                                </underlyer>
                                <underlyer>
                                    <index>
                                        <instrumentId instrumentIdScheme="http://www.fpml.org/spec/2003/instrument-id-RED-pair-1-0">2I65BYCX1</instrumentId>
                                    </index>
                                </underlyer>
                                <calculationPeriod>
                                    <adjustedStartDate>2014-03-20</adjustedStartDate>
                                    <adjustedEndDate>2014-06-19</adjustedEndDate>
                                    <numberOfDays>92</numberOfDays>
                                    <dayCountFraction dayCountFractionScheme="http://www.fpml.org/coding-scheme/day-count-fraction-1-0">ACT/360</dayCountFraction>
                                </calculationPeriod>
                            </calculationElements>
                        </calculationDetails>
                    </payment>
                    <party id="DTCC00002222">
                        <partyId partyIdScheme="DTCC">DTCC00002222</partyId>
                    </party>
                    <party id="DTCC00001111">
                        <partyId partyIdScheme="DTCC">DTCC00001111</partyId>
                    </party>
                </FpML>
                <OriginalAdjustedPaymentDate>2014-06-20</OriginalAdjustedPaymentDate>
            </Payment>
        </OTC_Matching>
    </env:Body>
</env:Envelope>